#### ConcreteSealantType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "ConcreteSealant" from the "Concrete" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ConcreteSealantType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ConcreteSealantType ``` |

| Visual C++ |
| --- |
| ``` public enum class ConcreteSealantType ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| Epoxy |  |
| Acrylic |  |

# See Also

Autodesk.Revit.DB.Visual Namespace